app/controllers/comments_controller.rb

SELECT * FROM "comments"
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 5)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 5)
UPDATE "comments" SET "updated_at" = '2010-07-21 22:17:20', "user_id" = 1 WHERE "id" = 2
---
  def update
    @comment = Comment.find(params[:id])
    @comment.user = current_user

    respond_to do |format|
      if @comment.update_attributes(params[:comment])

SELECT * FROM "comments" WHERE ("comments"."id" = 5)
DELETE FROM "comments" WHERE "id" = 5
---
  def destroy
    @comment = Comment.find(params[:id])
    @task = @comment.task #to redirect to task

    if logged_in?
	    if @comment.user != current_user
		    redirect_to(@task, :notice => 'Could not destroy.')
		else
		@comment.destroy