app/controllers/companies_controller.rb

SELECT * FROM "companies"
---
  def index
    @companies = Company.all

SELECT * FROM "companies" WHERE ("companies"."id" = '1') LIMIT 1
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def edit
    @company = Company.find(params[:id])

INSERT INTO "companies" ("name", "created_at", "updated_at", "domain", "user_id") VALUES('test', '2010-08-30 07:23:14', '2010-08-30 07:23:14', NULL, NULL)
---
  def create
    @company = Company.new(params[:company])

    if !current_user.nil
	    @company.user = current_user
    end

    respond_to do |format|
      if @company.save

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def update
    @company = Company.find(params[:id])

SELECT * FROM "companies" WHERE ("companies"."id" = 2)
DELETE FROM "companies" WHERE "id" = 2
---
  def destroy
    @company = Company.find(params[:id])

    if !current_user.nil
	    if @company.user != current_user
		    redirect_to(@company, :notice => 'Could not destroy.')
		else
		@company.destroy