app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM "projects"

  def create
    @project = Project.new(params[:project])
    @project.user = current_user

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "company_id") VALUES(NULL, '2010-06-13 10:55:14', '2010-06-13 10:55:14', NULL)

  def update
    @project = Project.find(params[:id])
    @project.user = current_user

    @project.tasks.each do |t| # set every .nil task to current user
	debugger
	if t.user.nil?
	   t.user = current_user
	end
    end

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "tasks" WHERE ("tasks".project_id = 21)
UPDATE "projects" SET "updated_at" = '2010-06-15 21:43:18', "name" = 'Do stuff', "company_id" = 2 WHERE "id" = 3

  def destroy
    @project = Project.find(params[:id])
    @company = @project.company

    if current_user
	    if @project.user != current_user
		    redirect_to(@project, :notice => 'Could not destroy.')
		else
		@project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 2)
DELETE FROM "projects" WHERE "id" = 2