app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 7)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 9)

  def update
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 7)